#--------------------------------#
#### 1. 음반 판매량 데이터 수집 ####
#--------------------------------#
albums = read.csv("album.csv")
head(albums)

#--------------------------------#
#### 2. 최댓값과 최솟값 ####
#--------------------------------#
# 앨범 판매량의 최솟값과 최댓값을 구한다. 
albums$sales

sort(albums$sales) # 오름차순 
sort(albums$sales)[1] # 최솟값
sort(albums$sales)[length(albums$sales)] # 최댓값
sort(albums$sales, decreasing = TRUE)[1] # 최댓값
min(albums$sales) # 최솟값
max(albums$sales) # 최댓값

#--------------------------------#
#### 3. 최빈값 ####
#--------------------------------#
table(albums$sales)

#--------------------------------#
#### 4. 평균과 중앙값 ####
#--------------------------------#
