#--------------------------------#
#### 1. 음반 판매량 데이터 수집 ####
#--------------------------------#


#--------------------------------#
#### 2. 최댓값과 최솟값 ####
#--------------------------------#
# 앨범 판매량의 최솟값과 최댓값을 구한다. 


#--------------------------------#
#### 3. 최빈값 ####
#--------------------------------#

#--------------------------------#
#### 4. 평균과 중앙값 ####
#--------------------------------#


# 결측치 데이터 추가


# which(x)
# 논리를 전달 받아 참값의 인덱스를 반환함


# 평균의 가장 큰 단덤은 양 끝 값의 변화에 대해 민감하게 반응하는 것

# 값 하나 추가되었지만, 평균 값이 처음보다 매우 크게 상승함


# 중앙값은 극단값이 들어와도 큰 변동성이 없는 것을 의미


# 극단값 추가 


# 중앙값은 양 끝 값의 변화에 민감하게 반응하지 않음. 
# 이러한 특징을 강건하다(robust)라고 함. 
#--------------------------------#
#### 5. 표준편차와 사분위수 범위 ####
#--------------------------------#

# 분산 구하기


# 표준편차 구하기


# R의 내장 함수


# 모집단의 분산


# 모집단의 표준편차


