#--------------------------------#
#### 1. 문제 ####
#--------------------------------#

# 사건 개요
# 00 과자 가격의 무게는 150g으로 표시가 되어 있음
# 총 10개의 과자를 구매한 결과, 평균 148g, 표준편차는 7.5g으로 판명됨
# 실제 과자의 평균 무게는 150g 아닌지 검정한다. 



#--------------------------------#
#### 1. 문제 ####
#--------------------------------#
# 단일 모집단의 비율에 대한 가설 검정
# 가설 설정
# 귀무가설: 핸드폰 액정의 불량률은 10% 미만이다
# 대립가설: 핸드폰 액정의 불량률은 10%를 넘는다
# 데이터 현황
# 표본의 수는 200개, 총 22개가 불량으로 확인됨




#--------------------------------#
#### 2. 데이터 수집 ####
#--------------------------------#


#--------------------------------#
#### 2. 문제 1 ####
#--------------------------------#
# versicolor 종 데이터만 추출한다. 


# sepal_length의 평균과 표준편차를 구한다. 


# 문제, t-분포에 의하여 다음 가설검정에 해당하는 통계 분석을 실시하세요. 

# 귀무가설: 전체 데이터의 sepal_length의 평균과 versicolor sepal_length의 평균의 차이는 없다. 
# 대립가설: 전체 데이터의 sepal_length의 평균과 versicolor sepal_length의 평균의 차이는 있다. 


# 유의수준 및 임계값 구하기


# 유의확률


# t.test 활용

# 왼쪽 검정 (less)
# 오른쪽 검정 (greater)


#--------------------------------#
#### 2. 문제 2 ####
#--------------------------------#
# 이번에는 setosa 종과 함께 평균 비교를 해본다. 


# sepal_length의 평균과 표준편차를 구한다. 

# 문제, t-분포에 의하여 다음 가설검정에 해당하는 통계 분석을 실시하세요. 

# 귀무가설: 전체 데이터의 sepal_length의 평균과 versicolor sepal_length의 평균의 차이는 없다. 
# 대립가설: 전체 데이터의 sepal_length의 평균과 versicolor sepal_length의 평균의 차이는 있다. 


# 유의수준 및 임계값 구하기


# 유의확률


# t.test 활용



